{
    "recipes":[
        {
            "id":1,
            "image":"/Images/DoubleCheese&SpringVegetableTart.jpg",
            "name":"Double cheese & spring vegetable tart",
            "prep":"30 mins",
            "cook":"60 mins",
            "serves": 8,
            "ratings": 13,
            "desc": "This savoury make-ahead tart has a delicious crumbly base – no one will realise it's shop-bought pastry! Fill with goat's cheese and beautiful spring veg including asparagus and fresh peas",
            "ingredients":[
                "500g block shortcrust pastry",
                "plain flour , for dusting",
                "25g mature cheddar , finely grated",
                "200g asparagus spears , woody ends trimmed",
                "100g fresh podded or frozen peas",
                "2 eggs",
                "100g crème fraîche",
                "150g double cream",
                "whole nutmeg , for grating",
                "100g watercress",
                "300g or 2 logs of soft, rindless goat’s cheese"],
            "nutrition":{
                "kcal":755,
                "fat":"63g",
                "saturates":"35g",
                "carbs":"26g",
                "sugars":"3g",
                "fibre":"3g",
                "protein":"18g",
                "salt":"1.1g"
            },
            "method":[
                "Roll the pastry out into a rectangle on a work surface lightly dusted with flour. Scatter over the cheese, fold the pastry in half and roll out again into a circle that fits a 25cm tart tin with an overhang. Chill for 20 mins. Meanwhile, cook the asparagus in boiling water for 3 mins, then drain and refresh under cold water. Cook the fresh peas the same way for a minute, or simply defrost the frozen peas.",
                "Heat oven to 200C/180C fan/gas 6. Prick the base of the tart well with a fork, line with baking parchment and fill with baking beans. Bake the tart for 30 mins, remove the parchment and beans, prick again if it has puffed up, then bake for another 10-15 mins until biscuit brown.",
                "Meanwhile, beat the eggs in a bowl, add the crème fraîche and cream, season and add a pinch of freshly grated nutmeg. Scatter the peas and most of the watercress over the tart and crumble over half the goat’s cheese. Pour over the creamy egg mixture, then lay the asparagus spears on top. Finally, slice the remaining goat’s cheese and arrange on top, then bake for 25-30 mins until the custard is just set and the cheese is golden brown. Leave to cool in the tin, trim the edges of the pastry, then remove from the tin, scatter with the remaining watercress and serve cut into slices. Can be made up to a day ahead, leave out the fridge to keep the pastry crisp."
            ]
        },
        {
            "id":2,
            "image":"/Images/One-potChickenChasseur.jpg",
            "name":"One-pot chicken chasseur",
            "prep":"20 mins",
            "cook":"90 mins",
            "serves": 4,
            "ratings": 511,
            "desc": "This French bistro classic is easy to make at home and fabulous with creamy mash or crusty bread",
            "ingredients":[
                "1kg silverside or topside of beef with no added fat",
                "2 tbsp olive oil",
                "8 young carrots, tops trimmed (but leave a little, if you like)",
                "1 celery stick, finely chopped",
                "200ml white wine",
                "600ml rich beef stock",
                "2 bay leaves",
                "500g onion",
                "a few thyme sprigs",
                "1 tsp butter",
                "1 tsp light brown or light muscovado sugar",
                "2 tsp plain flour"
            ],
            "nutrition":{
                "kcal":487,
                "fat":"17g",
                "saturates":"5g",
                "carbs":"19g",
                "sugars":"15g",
                "fibre":"5g",
                "protein":"6g",
                "salt":"1g"
            },
            "method":[
                "Heat 1 tsp olive oil and half of the 25g butter in a large lidded casserole.",
                "Season 4 chicken legs, then fry for about 5 mins on each side until golden brown. Remove and set aside.",
                "Melt the remaining butter in the pan. Add 1 chopped onion, then fry for about 5 mins until soft.",
                "Add 2 crushed garlic cloves, cook for about 1 min, add 200g small button or chestnut mushrooms, cook for 2 mins, then add 225ml red wine.",
                "Stir in 2 tbsp tomato purée, let the liquid bubble and reduce for about 5 mins, then stir in 2 thyme sprigs and pour over 500ml chicken stock.",
                "Slip the chicken legs back into the pan, then cover and simmer on a low heat for about 1 hr until the chicken is very tender.",
                "Remove the chicken legs from the pan and keep warm. Rapidly boil down the sauce for 10 mins or so until it is syrupy and the flavour has concentrated.",
                "Put the chicken legs back into the sauce and serve."
            ] 
        },
        {
            "id":3,
            "image":"/Images/Pot-roastBeefWithFrenchOnionGravy.jpg",
            "name":"Pot-roast beef with French onion gravy",
            "prep":"15 mins",
            "cook":"135 mins",
            "serves": 4,
            "ratings": 148,
            "desc": "Silverside and topside are cheaper and leaner cuts of meat, well-suited to slow-cooking. The stock and juices make a great sauce when combined with caramelised onions",
            "ingredients":[
                "1 tsp olive oil",
                "25g butter",
                "4 chicken legs",
                "1 onion, chopped",
                "2 garlic cloves, crushed",
                "200g pack small button or chestnut mushrooms",
                "225ml red wine",
                "2 tbsp tomato purée",
                "2 thyme sprigs",
                "500ml chicken stock"
            ],
            "nutrition":{
                "kcal":439,
                "fat":"28g",
                "saturates":"10g",
                "carbs":"7g",
                "sugars":"6g",
                "fibre":"2g",
                "protein":"35g",
                "salt":"1.11g"
            },
            "method":[
                "Heat oven to 160C/140C fan/gas 3. Rub the meat with 1 tsp of the oil and plenty of seasoning. Heat a large flameproof casserole dish and brown the meat all over for about 10 mins. Meanwhile, add 2 tsp oil to a frying pan and fry the carrots and celery for 10 mins until turning golden.",
                "Lift the beef onto a plate, splash the wine into the hot casserole and boil for 2 mins. Pour in the stock, return the beef, then tuck in the carrots, celery and bay leaves, trying not to submerge the carrots too much. Cover and cook in the oven for 2 hrs. (I like to turn the beef halfway through cooking.)",
                "Meanwhile, thinly slice the onions. Heat 1 tbsp oil in a pan and stir in the onions, thyme and some seasoning. Cover and cook gently for 20 mins until the onions are softened but not coloured. Remove the lid, turn up the heat, add the butter and sugar, then let the onions caramelise to a dark golden brown, stirring often. Remove the thyme sprigs, then set aside.",
                "When the beef is ready, it will be tender and easy to pull apart at the edges. Remove it from the casserole and snip off the strings. Reheat the onion pan, stir in the flour and cook for 1 min. Whisk the floury onions into the beefy juices in the casserole, to make a thick onion gravy. Taste for seasoning. Add the beef and carrots back to the casserole, or slice the beef and bring to the table on a platter, with the carrots to the side and the gravy spooned over."
            ] 
        },
        {
            "id":4,
            "image":"/Images/DauphinoisePotatoes.jpg",
            "name":"Dauphinoise potatoes",
            "prep":"20 mins",
            "cook":"45 mins",
            "serves": 8,
            "ratings": 261,
            "desc": "Thin slices of potato slow cooked in the oven with cream and garlic – the most decadent of side dishes",
            "ingredients":[
                "500ml double cream",
                "500ml milk",
                "3 garlic cloves",
                "8 large King Edward or Maris Piper potatoes",
                "100g grated gruyère cheese (optional)"
            ],
            "nutrition":{
                "kcal":541,
                "fat":"39g",
                "saturates":"22g",
                "carbs":"39g",
                "sugars":"5g",
                "fibre":"3g",
                "protein":"11g",
                "salt":"0.35g"
            },
            "method":[
                "Heat oven to 190C/170C fan/gas 5.",
                "Tip 500ml double cream, 500ml milk and 3 garlic cloves into a large saucepan and bring to a simmer.",
                "Slice 8 large potatoes very finely, about 3-4mm, add them to the cream and simmer for 3 mins until just cooked.",
                "Gently stir to separate the potato and stop it sinking and catching on the bottom of the pan.",
                "Remove the potatoes with a slotted spoon and place in a wide shallow ovenproof dish so that they are about 5cm in depth.",
                "Pour over the garlic infused cream (discarding the garlic) – just enough to seep through the layers and leave a little moisture on the surface.",
                "Scatter over 100g grated gruyère cheese, if using, then bake for 30 mins until the potatoes are soft and browned – increase the heat for 5 mins if not brown enough."
            ] 
        },
        {
            "id":5,
            "image":"/Images/ButterflyCakes.jpg",
            "name":"Butterfly cakes",
            "prep":"15 mins",
            "cook":"15 mins",
            "serves": 10,
            "ratings": 49,
            "desc": "Treat family and friends to pretty butterfly cupcakes. Ours easy buns are topped with a light vanilla buttercream, jam and sprinkles, but you can decorate any way you like",
            "ingredients":[
                "110g butter , softened",
                "110g caster sugar",
                "2 eggs",
                "1 tsp vanilla extract",
                "110g self-raising flour",
                "½ tsp baking powder",
                "1 tbsp milk , plus 2 tbsp if needed, to loosen the buttercream",
                "strawberry jam (optional)",
                "sprinkles (optional)",
                "300g icing sugar",
                "150g butter , softened",
                "2 tsp vanilla paste"
            ],
            "nutrition":{
                "kcal":419,
                "fat":"23g",
                "saturates":"14g",
                "carbs":"50g",
                "sugars":"42g",
                "fibre":"0g",
                "protein":"3g",
                "salt":"0.7g"
            },
            "method":[
                "Heat the oven to 180C/160C fan/gas 4. Line a cupcake tin with 10 cases. To make the sponge, tip the butter, sugar, eggs, vanilla, flour, baking powder and milk into a large mixing bowl and beat with either a hand whisk or electric mixer until smooth, pale and combined. Divide the batter between the cases and bake for 15 mins until golden brown and a skewer inserted in the middle of a cake comes out clean. Leave on a wire rack to cool.",
                "While the cakes are cooling, make the buttercream by beating together the icing sugar, butter and vanilla until pale and fluffy. Mix in the extra milk if the icing feels too stiff.",
                "Once the cakes are cool, use a sharp knife to slice off the tops, then cut the tops in half. Pipe or spread the buttercream on top of the cakes, then gently push two semi-circular halves into the buttercream on each cake, doing this at an angle to look like butterfly wings. You can serve the cupcakes at this stage, or decorate them with a little blob of jam in the centre and a scattering of sprinkles, if you like."
            ] 
        },
        {
            "id":6,
            "image":"/Images/Haddock&LeekAuGratinWithSweetcornMash.jpg",
            "name":"Haddock & leek au gratin with sweetcorn mash",
            "prep":"10 mins",
            "cook":"50 mins",
            "serves": 2,
            "ratings": 13,
            "desc": "Leek and spinach are layered up with white fish fillets and cheese sauce then topped with golden mash in this delicious, low-fat oven bake.",
            "ingredients":[
                "350g potatoes , quartered",
                "195g can sweetcorn in water",
                "240g bag ready-washed spinach",
                "2 leeks , thickly sliced",
                "300ml skimmed milk , plus 3 tbsp",
                "15g unsalted butter",
                "15g plain flour",
                "½ tsp English mustard",
                "75g mature reduced-fat cheese , grated",
                "2 x 125g fillets of skinless haddock"
            ],
            "nutrition":{
                "kcal":618,
                "fat":"13g",
                "saturates":"6g",
                "carbs":"70g",
                "sugars":"20g",
                "fibre":"11g",
                "protein":"50g",
                "salt":"2.1g"
            },
            "method":[
                "Heat oven to 200C/180 fan/gas 6. Boil the potatoes for 15-20 mins until tender, then drain. Reserve 3 tbsp corn and blitz the rest (with its juice) using a hand blender or a food processor until completely smooth, then mash into the potatoes. Cook the spinach following pack instructions – if you have a microwave, choose this method.",
                "Put the leeks in a pan with the 300ml milk and the butter. Cook gently, part-covered, for 8 mins until the leeks are tender. (Keep an eye on things as milk can easily boil over.) Mix the 3 tbsp milk with the flour and mustard, then stir into the leek mixture – keep stirring until thickened. Take off the heat and stir in three-quarters of the cheese.",
                "Squeeze as much liquid as you can from the spinach, then arrange on the base of 2 gratin dishes. Place a fish fillet on top of each, then spoon over the leek & cheese sauce. Top with the sweetcorn mash. Mix the remaining corn and cheese, and scatter on top. Place the dishes on a baking tray and cook for 25 mins until the fish flakes when tested and the top is golden."
            ] 
        },
        {
            "id":7,
            "image":"/Images/CreamyEggCurry.jpg",
            "name":"Creamy egg curry",
            "prep":"10 mins",
            "cook":"20 mins",
            "serves": 4,
            "ratings": 38,
            "desc": "It may seem like an unusual combination but this is delicious. Why not try it and see.",
            "ingredients":[
                "2 tbsp sunflower oil",
                "2 onions , thinly sliced",
                "2 heaped tbsp curry paste (we used Pataks Tikka Masala)",
                "400g can chopped tomato",
                "8 eggs",
                "140g frozen pea",
                "4 tbsp Greek yogurt",
                "rice and mango chutney to serve"
            ],
            "nutrition":{
                "kcal":336,
                "fat":"24g",
                "saturates":"5g",
                "carbs":"11g",
                "sugars":"7g",
                "fibre":"3g",
                "protein":"20g",
                "salt":"1.02g"
            },
            "method":[
                "Heat the oil in a pan, then fry the onions over a low heat for 10 mins until golden. Add the curry paste and sizzle for 2 mins, stirring. Add the tomatoes and 200ml water, season to taste, then bring to the boil. Simmer for 10 mins until you have a rich sauce.",
                "Meanwhile, boil the eggs for 8 mins, cool in cold water, then peel and halve. 3 Stir the peas and yogurt into the curry and simmer for another 2-3 mins. Put the eggs into the pan, spoon the curry sauce over and leave for another 2 mins to heat through. Serve with rice and mango chutney."
            ] 
        },
        {
            "id":8,
            "image":"/Images/RoastCauliflowerWithCaperDressing.jpg",
            "name":"Roast cauliflower with caper dressing",
            "prep":"20 mins",
            "cook":"40 mins",
            "serves": 6,
            "ratings": 6,
            "desc": "Cooking cauliflower this way gives it a richness that's balanced by the dressing. A great side dish for a roast dinner and it also works as a vegetarian main",
            "ingredients":[
                "1 medium cauliflower , leaves trimmed and reserved",
                "50g butter , softened",
                "1 tbsp olive oil",
                "4 tbsp capers",
                "2 tbsp chopped parsley",
                "1 lemon , zested and juiced"
            ],
            "nutrition":{
                "kcal":112,
                "fat":"9g",
                "saturates":"5g",
                "carbs":"4g",
                "sugars":"3g",
                "fibre":"2g",
                "protein":"2g",
                "salt":"0.7g"
            },
            "method":[
                "Heat oven to 190C/170C fan/gas 5. Scatter the cauliflower leaves into a small roasting tin, then sit the cauliflower in the middle. Rub over the butter, sprinkle with some salt and roast for 20 mins.",
                "Reduce the temperature to 160C/140C/gas 3 and cook the cauliflower for 20 mins more, basting with butter. Add the oil, capers, parsley and lemon zest and juice to the hot butter and spoon over the cauliflower a few times before serving – it will soak up the dressing flavour. When you’re ready to serve, cut into wedges and serve with the crisp leaves."
            ] 
        },
        {
            "id":9,
            "image":"/Images/Spinach&RicottaPancakeBake.jpg",
            "name":"Spinach & ricotta pancake bake",
            "prep":"10 mins",
            "cook":"35 mins",
            "serves": 4,
            "ratings": 12,
            "desc": "Make pancakes on Shrove Tuesday and serve our spinach and ricotta pancake bake for dinner. For dessert, choose one of our sweet pancake recipes",
            "ingredients":[
                "1 tbsp olive oil , plus a drizzle",
                "3 garlic cloves , crushed",
                "400g can chopped tomatoes",
                "200g bag baby spinach",
                "250g tub ricotta",
                "grating of nutmeg",
                "4 large pancakes or crêpes (see recipe, below)",
                "225g ball mozzarella , drained and torn into small pieces",
                "50g parmesan or vegetarian alternative, grated"
            ],
            "nutrition":{
                "kcal":513,
                "fat":"32g",
                "saturates":"17g",
                "carbs":"25g",
                "sugars":"8g",
                "fibre":"2g",
                "protein":"30g",
                "salt":"1.1g"
            },
            "method":[
                "Heat the oil in a pan, add 2 garlic cloves and sizzle for a few seconds, then tip in the tomatoes. Season, and bubble for 10-15 mins until reduced to a thick sauce. Microwave the spinach for 2 mins to wilt, or by tipping into a colander and pouring over a kettle full of hot water. When cool enough to handle, squeeze out as much liquid as you can, then roughly chop.",
                "Heat the oven to 220C/200C fan/gas 7. Mix together the ricotta, spinach, a generous grating of nutmeg, the remaining crushed garlic and some salt and pepper. Spread the tomato sauce over the base of a shallow baking dish about 20cm x 30cm. Divide the spinach mixture between the pancakes, spreading it over half the surface. Fold each pancake in half, then in half again to make a triangle. Lay the pancakes on top of the sauce, scatter with the mozzarella and parmesan. Drizzle with a little more oil and bake for 15-20 mins until bubbling."
            ] 
        },
        {
            "id":10,
            "image":"/Images/ChilliCheeseOmelette.jpg",
            "name":"Chilli cheese omelette",
            "prep":"10 mins",
            "cook":"0 mins",
            "serves": 1,
            "ratings": 10,
            "desc": "A quick and easy classic with added spice - just six ingredients too",
            "ingredients":[
                "1 spring onion",
                "a few sprigs of fresh coriander",
                "2 large eggs",
                "1 tbsp sunflower oil",
                "½ -1 tsp chopped fresh red chilli , or a generous pinch dried chilli flakes",
                "25g mild grated cheddar"
            ],
            "nutrition":{
                "kcal":381,
                "fat":"33g",
                "saturates":"10g",
                "carbs":"0g",
                "sugars":"0g",
                "fibre":"0g",
                "protein":"22g",
                "salt":"0.86g"
            },
            "method":[
                "Chop the spring onion and coriander quite finely and beat the eggs together with salt and pepper. Heat the oil in a small frying pan then tip in the onion, coriander and chilli and stir round the pan for a second or two so they soften a little. Pour in the eggs and keep them moving until two thirds have scrambled.",
                "Settle the eggs back down on the base of the pan, scatter over the cheese and cook for about a minute until the omelette is just set and the cheese has melted.",
                "Carefully fold the omelette using a palette knife and slide from the pan to a serving plate. Eat while the omelette is hot and the cheese still melted."
            ] 
        },
        {
            "id":11,
            "image":"/Images/Slow-cookerVegetableLasagne.jpg",
            "name":"Slow-cooker vegetable lasagne",
            "prep":"30 mins",
            "cook":"180 mins",
            "serves": 4,
            "ratings": 125,
            "desc": "Make this low-calorie veggie lasagne as a lighter alternative to the traditional bake. It's layered with pasta, ratatouille and sliced aubergine, and packs in all of your five-a-day",
            "ingredients":[
                "1 tbsp rapeseed oil",
                "2 onions, sliced",
                "2 large garlic cloves, chopped",
                "2 large courgettes, diced (400g)",
                "1 red and 1 yellow pepper, deseeded and roughly sliced",
                "400g can chopped tomatoes",
                "2 tbsp tomato purée",
                "2 tsp vegetable bouillon",
                "15g fresh basil, chopped plus a few leaves",
                "1 large aubergine, sliced across length or width for maximum surface area",
                "6 wholewheat lasagne sheets (105g)",
                "125g vegetarian buffalo mozzarella, chopped"
            ],
            "nutrition":{
                "kcal":325,
                "fat":"11g",
                "saturates":"5g",
                "carbs":"36g",
                "sugars":"17g",
                "fibre":"11g",
                "protein":"15g",
                "salt":"0.44g"
            },
            "method":[
                "Heat 1 tbsp rapeseed oil in a large non-stick pan and fry 2 sliced onions and 2 chopped large garlic cloves for 5 mins, stirring frequently until softened.",
                "Tip in 2 diced large courgettes, 1 red and 1 yellow pepper, both roughly sliced, and 400g chopped tomatoes with 2 tbsp tomato purée, 2 tsp vegetable bouillon and 15g chopped basil.",
                "Stir well, cover and cook for 5 mins. Don't be tempted to add more liquid as plenty of moisture will come from the vegetables once they start cooking.",
                "Slice 1 large aubergine. Lay half the slices of aubergine in the base of the slow cooker and top with 3 sheets of lasagne.",
                "Add a third of the ratatouille mixture, then the remaining aubergine slices, 3 more lasagne sheets, then the remaining ratatouille mixture.",
                "Cover and cook on High for 2½ - 3 hours until the pasta and vegetables are tender. Turn off the machine.",
                "Scatter 125g vegetarian buffalo mozzarella over the vegetables then cover and leave for 10 mins to settle and melt the cheese.",
                "Scatter with extra basil and serve with a handful of rocket."
            ] 
        },
        {
            "id":12,
            "image":"/Images/PastaWithSalmon&Peas.jpg",
            "name":"Pasta with salmon & peas",
            "prep":"15 mins",
            "cook":"12 mins",
            "serves": 4,
            "ratings": 258,
            "desc": "Make this salmon pasta in under 20 minutes for a dinner the whole family can enjoy. Kids will love the fun-shaped pasta while packing in fibre and omega-3",
            "ingredients":[
                "240g wholewheat fusilli",
                "knob of butter",
                "1 large shallot, finely chopped",
                "140g frozen peas",
                "2 skinless salmon fillets, cut into chunks",
                "140g low-fat crème fraîche",
                "½ low-salt vegetable stock cube",
                "small bunch of chives, snipped"
            ],
            "nutrition":{
                "kcal":463,
                "fat":"19g",
                "saturates":"6g",
                "carbs":"44g",
                "sugars":"5g",
                "fibre":"7g",
                "protein":"25g",
                "salt":"0.2g"
            },
            "method":[
                "Bring a pan of water to the boil and cook the fusilli according to the pack instructions.",
                "Meanwhile, heat a knob of butter in a saucepan, then add the shallot and cook for 5 mins or until softened.",
                "Add the peas, salmon, crème fraîche and 50ml water. Crumble in the stock cube.",
                "Cook for 3-4 mins until cooked through, stir in the chives and some black pepper. Then stir through to coat the pasta. Serve in bowls."
            ] 
        },
        {
            "id":13,
            "image":"/Images/CoconutCurryNoodleBowl.jpg",
            "name":"Coconut curry noodle bowl",
            "prep":"10 mins",
            "cook":"25 mins",
            "serves": 4,
            "ratings": 26,
            "desc": "This creamy noodle dish is topped with crunchy cashew nuts for added flavour and texture. It's a simple vegan supper, perfect for feeding the family",
            "ingredients":[
                "1 tbsp vegetable oil",
                "2 garlic cloves , crushed",
                "½ red chilli , finely chopped (optional)",
                "small piece ginger , grated",
                "1 tbsp mild curry powder",
                "1 tbsp soy sauce",
                "1 tbsp sriracha (or another 1 tbsp soy sauce is you don't want the sauce hot)",
                "400g can coconut milk",
                "80g cashew nuts",
                "1 tsp soy sauce",
                "1 tsp maple syrup",
                "1 tsp sesame oil",
                "2 heads pak choi , halved",
                "200g green beans , trimmed and halved",
                "2 carrots , peeled into long ribbons",
                "3 x 150g packs fresh udon noodles",
                "large handful coriander , chopped, to serve"
            ],
            "nutrition":{
                "kcal":533,
                "fat":"31g",
                "saturates":"17g",
                "carbs":"44g",
                "sugars":"11g",
                "fibre":"10g",
                "protein":"15g",
                "salt":"1.3g"
            },
            "method":[
                "Heat the oil in a large saucepan, add the garlic, chilli (if using) and ginger, and fry on a low heat for about 5 mins until softened. Add the curry powder and stir, frying for 1 min more until aromatic. Add the soy sauce and sriracha (if using), and stir again. Pour in the coconut milk, breaking up any solids on the top of the can with a spoon. Stir until combined, then leave the sauce on a medium heat with a lid on to simmer for 15 mins.",
                "Meanwhile, heat oven to 200C/180C fan/gas 6. Put the nuts in a bowl and mix with the soy sauce and maple syrup until fully coated. Scatter the nuts on a sheet of baking parchment on a baking tray, and roast for 10-12 mins, stirring halfway through.",
                "While the nuts are roasting, heat the sesame oil in a wok or large frying pan. When hot, add the veg and stir-fry for 3-4 mins until slightly softened. Add the noodles and fry for another 2 mins until heated through.",
                "Take both pans off the heat and pour the coconut sauce into the wok (or add the noodles to the saucepan) and stir until everything is coated in the sauce. Spoon into bowls and scatter over the nuts and coriander."
            ] 
        },
        {
            "id":14,
            "image":"/Images/WeddingCake-RichDarkChocolateCake.jpg",
            "name":"Wedding cake - rich dark chocolate cake",
            "prep":"40 mins",
            "cook":"150 mins",
            "serves": 50,
            "ratings": 137,
            "desc": "This recipe makes the bottom layer of our three tier wedding cake or a simple delicious chocolate cake, perfect with a touch of cream",
            "ingredients":[
                "650g unsalted butter",
                "650g plain chocolate (70% cocoa)",
                "100ml very strong coffee- espresso is ideal",
                "3 tsp vanilla essence",
                "650g plain flour",
                "2 tsp baking powder",
                "2 tsp bicarbonate of soda",
                "950g light soft brown sugar",
                "10 eggs",
                "2 x 284ml/9.5 fl oz soured cream"
            ],
            "nutrition":{
                "kcal":274,
                "fat":"16g",
                "saturates":"9g",
                "carbs":"30g",
                "sugars":"20g",
                "fibre":"1g",
                "protein":"3g",
                "salt":"0.23g"
            },
            "method":[
                "Heat oven to 160C/fan 140C/gas 3. Butter, double-line and wrap the sides of the 30cm deep-round cake tin as before. Put the butter and chocolate into a medium saucepan, then stir over a low heat until melted and smooth. Stir in the coffee and vanilla.",
                "Sift the flour, baking powder and bicarbonate of soda into the biggest bowl you have. Add the sugar, breaking down any lumps with your fingertips if necessary. Beat the eggs and soured cream together in a jug or bowl and pour into the flour mix. Pour in the melted chocolate mix as well, then stir with a wooden spoon until you have a thick, even chocolaty batter.",
                "Pour into the prepared tin and bake for 2½ hrs – don’t open the oven door before 2 hrs is up, as this will cause the cake to sink. Once cooked, leave in the tin to cool completely. The unfilled cake will keep for up to four days, wrapped as before, or frozen for a month."
            ] 
        },
        {
            "id":15,
            "image":"/Images/ChickenTikkaMasalaPizzas.jpg",
            "name":"Chicken tikka masala pizzas",
            "prep":"10 mins",
            "cook":"10 mins",
            "serves": 4,
            "ratings": 25,
            "desc": "Rustle up our spiced chicken pizzas using naan bread in just 20 minutes. To balance the heat, serve them with dollops of mango chutney and natural yogurt",
            "ingredients":[
                "1 small red onion , thinly sliced",
                "1 tbsp red wine vinegar",
                "4 garlic and coriander naan breads",
                "4 chicken breasts , cut into strips",
                "2 green pepper , sliced",
                "2-3 tbsp tikka masala curry paste",
                "150ml natural yogurt",
                "1 green chilli , thinly sliced",
                "1 small pack coriander , leaves torn",
                "few dollops of mango chutney , to serve"
            ],
            "nutrition":{
                "kcal":683,
                "fat":"16g",
                "saturates":"3g",
                "carbs":"83g",
                "sugars":"11g",
                "fibre":"7g",
                "protein":"47g",
                "salt":"2g"
            },
            "method":[
                "Heat oven to 180C/160C fan/gas 4. Toss the red onion with the red wine vinegar and a good pinch of salt and set aside (the vinegar will soften the onion slightly, which is a blessing as no one wants completely raw onion on pizza).",
                "Put the naan breads on a baking tray, sprinkle over a little water, then put in the oven for 2 mins to heat up. Meanwhile, put the chicken and peppers in a frying pan with the curry paste, toss together, then fry over a high heat for 6-8 mins until cooked.",
                "Take the naans out the oven, spread each one with yogurt, then top with the chicken, red onion, green chilli, coriander and mango chutney."
            ] 
        },
        {
            "id":16,
            "image":"/Images/SaltedCaramelChocPots.jpg",
            "name":"Salted caramel choc pots",
            "prep":"30 mins",
            "cook":"5 mins",
            "serves": 2,
            "ratings": 25,
            "desc": "Combining sweet and salty flavours really works when chocolate and toffee is involved - best served in individual portions",
            "ingredients":[
                "4 tbsp dulce de leche or canned caramel (we used Carnation)",
                "½ tsp sea salt , plus extra to serve",
                "85g each milk and dark chocolate , broken into squares",
                "1-2 long, thin, plain grissini",
                "2 tbsp demerara sugar",
                "100ml double cream , at room temperature",
                "50ml milk"
            ],
            "nutrition":{
                "kcal":847,
                "fat":"53g",
                "saturates":"32g",
                "carbs":"83g",
                "sugars":"79g",
                "fibre":"2g",
                "protein":"8g",
                "salt":"1.5g"
            },
            "method":[
                "Mix the caramel with the salt, divide between 2 small glasses and chill.",
                "Melt the chocolates together in a glass bowl set over a pan of barely simmering water. Snap the grissini into short lengths, then dip each end into the chocolate to coat a little. Sit on a wire rack for the chocolate to drip and set a little, then dip the chocolate ends into the sugar to coat. Sit in an airtight container lined with baking parchment and chill to set until ready to serve.",
                "Stir the double cream and milk into the remaining melted chocolate until smooth, then scrape into a jug. Slowly pour on top of the caramel, around the edges first. Chill the pots for at least 2 hrs, or up to 24 hrs.",
                "To serve, scatter a little more sea salt on top of each pot, then add one or two sugar-tipped grissini."
            ] 
        },
        {
            "id":17,
            "image":"/Images/SlowCookerRatatouille.jpg",
            "name":"Slow cooker ratatouille",
            "prep":"10 mins",
            "cook":"380 mins",
            "serves": 6,
            "ratings": 23,
            "desc": "Make up a batch of this slow-cooked ratatouille and freeze for easy midweek meals when you’re busy. Packed with nutrients, it also delivers four of your 5-a-day",
            "ingredients":[
                "2 tbsp olive oil",
                "1 red onion , sliced",
                "2 garlic cloves",
                "2 large aubergines , cut into 1.5cm pieces",
                "3 courgettes , halved and cut into 2cm pieces",
                "3 mixed peppers , cut into 2cm pieces",
                "1 tbsp tomato purée",
                "6 large ripe tomatoes , roughly chopped",
                "small bunch of basil , roughly chopped, plus a few extra leaves to serve",
                "few thyme sprigs",
                "400g can plum tomatoes",
                "1 tbsp red wine vinegar",
                "1 tsp brown sugar",
                "sourdough , to serve (optional)"
            ],
            "nutrition":{
                "kcal":162,
                "fat":"5g",
                "saturates":"1g",
                "carbs":"17g",
                "sugars":"16g",
                "fibre":"11g",
                "protein":"6g",
                "salt":"0.8g"
            },
            "method":[
                "Heat the oil in a large frying pan and fry the onion for 8 mins until translucent. Add the garlic and fry for 1 min. Turn the heat to medium-high, add the aubergines and fry for 5 mins until golden. Stir in the courgettes and peppers and fry for 5 mins more until slightly soft. Add the tomato purée, fresh tomatoes, herbs, canned tomatoes, vinegar, sugar and 1 tsp salt and bring to the boil.", 
                "Transfer to the slow cooker and cook on low for 5-6 hours or until everything is soft and the sauce has thickened. Season, scatter over some extra basil, and serve with sourdough, if you like."
            ] 
        },
        {
            "id":18,
            "image":"/Images/PassionFruitMartini.jpg",
            "name":"Passion fruit martini",
            "prep":"5 mins",
            "cook":"0 mins",
            "serves": 2,
            "ratings": 17,
            "desc": "This easy passion fruit cocktail is bursting with zingy flavours and is perfect for celebrating with friends. Top with prosecco for a special drink",
            "ingredients":[
                "2 ripe passion fruits (they should have a crinkly appearance), halved",
                "60ml vanilla vodka",
                "30ml passoa",
                "1 tbsp lime juice",
                "1 tbsp sugar syrup",
                "prosecco , to serve"
            ],
            "nutrition":{
                "kcal":224,
                "fat":"0g",
                "saturates":"0g",
                "carbs":"16g",
                "sugars":"16g",
                "fibre":"2g",
                "protein":"1g",
                "salt":"0.03g"
            },
            "method":[
                "Scoop the seeds from one of the passion fruits into the glass of a cocktail shaker, add the vodka, passoa, lime juice and sugar syrup. Add a handful of ice and shake well, strain into 2 martini glasses, top up with prosecco, then add half a passion fruit to each. Serve immediately."
            ] 
        },
        {
            "id":19,
            "image":"/Images/VeganChristmasPudding.jpg",
            "name":"Vegan Christmas pudding",
            "prep":"30 mins",
            "cook":"180 mins",
            "serves": 14,
            "ratings": 13,
            "desc": "Make this vegan Christmas pudding as part of a festive feast, packed with dried figs, raisins, sultanas and a tot of rum. Serve warm with vegan ice cream",
            "ingredients":[
                "125g dairy-free margarine, plus extra for greasing the bowl and paper",
                "375g dried figs",
                "75ml rum",
                "350g mixed sultanas and raisins",
                "1 large eating apple, peeled, cored and grated",
                "85g light brown soft sugar",
                "85g dark brown soft sugar",
                "100g breadcrumbs",
                "100g self-raising flour",
                "½ tbsp allspice"
            ],
            "nutrition":{
                "kcal":289,
                "fat":"6g",
                "saturates":"1g",
                "carbs":"50g",
                "sugars":"42g",
                "fibre":"4g",
                "protein":"3g",
                "salt":"0.3g"
            },
            "method":[
                "Grease a 2-litre pudding bowl with dairy-free margarine, then line the base with a circle of baking parchment. Grease a large sheet of baking parchment, then lay it on top of a large sheet of foil, margarine side up. Fold a pleat in the middle of each sheet.",
                "Roughly chop 125g of the figs and set aside. Put the remaining figs, the dairy-free margarine and the rum into a large food processor and whizz until smooth-ish, then scrape into a large mixing bowl. Tip in the chopped figs, sultanas, raisins, grated apple, sugars, breadcrumbs, flour and allspice. Stir everything together, then spoon into your pudding basin.",
                "Cover with the buttered paper-foil sheet, tie with string and trim. Lower into a large saucepan, with upturned saucers or scrunched-up bits of foil in the bottom (so the pud doesn’t touch the bottom), then fill the pan with enough boiling water from the kettle to come halfway up the sides of the bowl. Cover with a lid and simmer for 3 hrs, topping up the water as needed. Remove and leave to cool. Will keep in a cool, dry cupboard for up to a year."
            ] 
        },
        {
            "id":20,
            "image":"/Images/Martini.jpg",
            "name":"Martini",
            "prep":"5 mins",
            "cook":"0 mins",
            "serves": 1,
            "ratings": 4,
            "desc": "Our version of the ultimate classic cocktail is stirred, not shaken. Serve your martini with a twist of lemon, or an olive",
            "ingredients":[
                "60ml vodka or gin",
                "1 tbsp dry vermouth",
                "olive or lemon peel, to garnish"
            ],
            "nutrition":{
                "kcal":174,
                "fat":"0g",
                "saturates":"0g",
                "carbs":"0.4g",
                "sugars":"0.4g",
                "fibre":"0g",
                "protein":"0g",
                "salt":"0g"
            },
            "method":[
                "Stir the gin or vodka, dry vermouth and a little ice together or put them in a cocktail shaker to combine. ",
                "Strain into a chilled martini glass. Serve with an olive on a cocktail stick or a twist of lemon peel."
            ] 
        }
    ]
}