{
    "recipes":[
        {
            "id":1,
            "name":"Double cheese & spring vegetable tart",
            "prep":"30 mins",
            "cook":"60 mins",
            "serves": 8,
            "desc": "This savoury make-ahead tart has a delicious crumbly base – no one will realise it's shop-bought pastry! Fill with goat's cheese and beautiful spring veg including asparagus and fresh peas",
            "ingredients":[
                "500g block shortcrust pastry",
                "plain flour , for dusting",
                "25g mature cheddar , finely grated",
                "200g asparagus spears , woody ends trimmed",
                "100g fresh podded or frozen peas",
                "2 eggs",
                "100g crème fraîche",
                "150g double cream",
                "whole nutmeg , for grating",
                "100g watercress",
                "300g or 2 logs of soft, rindless goat’s cheese"],
            "nutrition":{
                "kcal":755,
                "fat":"63g",
                "saturates":"35g",
                "carbs":"26g",
                "sugars":"3g",
                "fibre":"3g",
                "protein":"18g",
                "salt":"1.1g"
            },
            "method":[
                "Roll the pastry out into a rectangle on a work surface lightly dusted with flour. Scatter over the cheese, fold the pastry in half and roll out again into a circle that fits a 25cm tart tin with an overhang. Chill for 20 mins. Meanwhile, cook the asparagus in boiling water for 3 mins, then drain and refresh under cold water. Cook the fresh peas the same way for a minute, or simply defrost the frozen peas.",
                "Heat oven to 200C/180C fan/gas 6. Prick the base of the tart well with a fork, line with baking parchment and fill with baking beans. Bake the tart for 30 mins, remove the parchment and beans, prick again if it has puffed up, then bake for another 10-15 mins until biscuit brown.",
                "Meanwhile, beat the eggs in a bowl, add the crème fraîche and cream, season and add a pinch of freshly grated nutmeg. Scatter the peas and most of the watercress over the tart and crumble over half the goat’s cheese. Pour over the creamy egg mixture, then lay the asparagus spears on top. Finally, slice the remaining goat’s cheese and arrange on top, then bake for 25-30 mins until the custard is just set and the cheese is golden brown. Leave to cool in the tin, trim the edges of the pastry, then remove from the tin, scatter with the remaining watercress and serve cut into slices. Can be made up to a day ahead, leave out the fridge to keep the pastry crisp."
            ]
        }
    ]
}