{
    "recipes":[
        {
            "id":1,
            "name":"Double cheese & spring vegetable tart",
            "prep":"30 mins",
            "cook":"60 mins",
            "serves": 8,
            "ratings": 13,
            "desc": "This savoury make-ahead tart has a delicious crumbly base – no one will realise it's shop-bought pastry! Fill with goat's cheese and beautiful spring veg including asparagus and fresh peas",
            "ingredients":[
                "500g block shortcrust pastry",
                "plain flour , for dusting",
                "25g mature cheddar , finely grated",
                "200g asparagus spears , woody ends trimmed",
                "100g fresh podded or frozen peas",
                "2 eggs",
                "100g crème fraîche",
                "150g double cream",
                "whole nutmeg , for grating",
                "100g watercress",
                "300g or 2 logs of soft, rindless goat’s cheese"],
            "nutrition":{
                "kcal":755,
                "fat":"63g",
                "saturates":"35g",
                "carbs":"26g",
                "sugars":"3g",
                "fibre":"3g",
                "protein":"18g",
                "salt":"1.1g"
            },
            "method":[
                "Roll the pastry out into a rectangle on a work surface lightly dusted with flour. Scatter over the cheese, fold the pastry in half and roll out again into a circle that fits a 25cm tart tin with an overhang. Chill for 20 mins. Meanwhile, cook the asparagus in boiling water for 3 mins, then drain and refresh under cold water. Cook the fresh peas the same way for a minute, or simply defrost the frozen peas.",
                "Heat oven to 200C/180C fan/gas 6. Prick the base of the tart well with a fork, line with baking parchment and fill with baking beans. Bake the tart for 30 mins, remove the parchment and beans, prick again if it has puffed up, then bake for another 10-15 mins until biscuit brown.",
                "Meanwhile, beat the eggs in a bowl, add the crème fraîche and cream, season and add a pinch of freshly grated nutmeg. Scatter the peas and most of the watercress over the tart and crumble over half the goat’s cheese. Pour over the creamy egg mixture, then lay the asparagus spears on top. Finally, slice the remaining goat’s cheese and arrange on top, then bake for 25-30 mins until the custard is just set and the cheese is golden brown. Leave to cool in the tin, trim the edges of the pastry, then remove from the tin, scatter with the remaining watercress and serve cut into slices. Can be made up to a day ahead, leave out the fridge to keep the pastry crisp."
            ]
        },
        {
            "id":2,
            "name":"One-pot chicken chasseur",
            "prep":"20 mins",
            "cook":"90 mins",
            "serves": 4,
            "ratings": 511,
            "desc": "This French bistro classic is easy to make at home and fabulous with creamy mash or crusty bread",
            "ingredients":[
                "1kg silverside or topside of beef with no added fat",
                "2 tbsp olive oil",
                "8 young carrots, tops trimmed (but leave a little, if you like)",
                "1 celery stick, finely chopped",
                "200ml white wine",
                "600ml rich beef stock",
                "2 bay leaves",
                "500g onion",
                "a few thyme sprigs",
                "1 tsp butter",
                "1 tsp light brown or light muscovado sugar",
                "2 tsp plain flour"
            ],
            "nutrition":{
                "kcal":487,
                "fat":"17g",
                "saturates":"5g",
                "carbs":"19g",
                "sugars":"15g",
                "fibre":"5g",
                "protein":"6g",
                "salt":"1g"
            },
            "method":[
                "Heat 1 tsp olive oil and half of the 25g butter in a large lidded casserole.",
                "Season 4 chicken legs, then fry for about 5 mins on each side until golden brown. Remove and set aside.",
                "Melt the remaining butter in the pan. Add 1 chopped onion, then fry for about 5 mins until soft.",
                "Add 2 crushed garlic cloves, cook for about 1 min, add 200g small button or chestnut mushrooms, cook for 2 mins, then add 225ml red wine.",
                "Stir in 2 tbsp tomato purée, let the liquid bubble and reduce for about 5 mins, then stir in 2 thyme sprigs and pour over 500ml chicken stock.",
                "Slip the chicken legs back into the pan, then cover and simmer on a low heat for about 1 hr until the chicken is very tender.",
                "Remove the chicken legs from the pan and keep warm. Rapidly boil down the sauce for 10 mins or so until it is syrupy and the flavour has concentrated.",
                "Put the chicken legs back into the sauce and serve."
            ] 
        },
        {
            "id":3,
            "name":"Pot-roast beef with French onion gravy",
            "prep":"15 mins",
            "cook":"135 mins",
            "serves": 4,
            "ratings": 148,
            "desc": "Silverside and topside are cheaper and leaner cuts of meat, well-suited to slow-cooking. The stock and juices make a great sauce when combined with caramelised onions",
            "ingredients":[
                "1 tsp olive oil",
                "25g butter",
                "4 chicken legs",
                "1 onion, chopped",
                "2 garlic cloves, crushed",
                "200g pack small button or chestnut mushrooms",
                "225ml red wine",
                "2 tbsp tomato purée",
                "2 thyme sprigs",
                "500ml chicken stock"
            ],
            "nutrition":{
                "kcal":439,
                "fat":"28g",
                "saturates":"10g",
                "carbs":"7g",
                "sugars":"6g",
                "fibre":"2g",
                "protein":"35g",
                "salt":"1.11g"
            },
            "method":[
                "Heat oven to 160C/140C fan/gas 3. Rub the meat with 1 tsp of the oil and plenty of seasoning. Heat a large flameproof casserole dish and brown the meat all over for about 10 mins. Meanwhile, add 2 tsp oil to a frying pan and fry the carrots and celery for 10 mins until turning golden.",
                "Lift the beef onto a plate, splash the wine into the hot casserole and boil for 2 mins. Pour in the stock, return the beef, then tuck in the carrots, celery and bay leaves, trying not to submerge the carrots too much. Cover and cook in the oven for 2 hrs. (I like to turn the beef halfway through cooking.)",
                "Meanwhile, thinly slice the onions. Heat 1 tbsp oil in a pan and stir in the onions, thyme and some seasoning. Cover and cook gently for 20 mins until the onions are softened but not coloured. Remove the lid, turn up the heat, add the butter and sugar, then let the onions caramelise to a dark golden brown, stirring often. Remove the thyme sprigs, then set aside.",
                "When the beef is ready, it will be tender and easy to pull apart at the edges. Remove it from the casserole and snip off the strings. Reheat the onion pan, stir in the flour and cook for 1 min. Whisk the floury onions into the beefy juices in the casserole, to make a thick onion gravy. Taste for seasoning. Add the beef and carrots back to the casserole, or slice the beef and bring to the table on a platter, with the carrots to the side and the gravy spooned over."
            ] 
        },
        {
            "id":4,
            "name":"Dauphinoise potatoes",
            "prep":"20 mins",
            "cook":"45 mins",
            "serves": 8,
            "ratings": 261,
            "desc": "Thin slices of potato slow cooked in the oven with cream and garlic – the most decadent of side dishes",
            "ingredients":[
                "500ml double cream",
                "500ml milk",
                "3 garlic cloves",
                "8 large King Edward or Maris Piper potatoes",
                "100g grated gruyère cheese (optional)"
            ],
            "nutrition":{
                "kcal":541,
                "fat":"39g",
                "saturates":"22g",
                "carbs":"39g",
                "sugars":"5g",
                "fibre":"3g",
                "protein":"11g",
                "salt":"0.35g"
            },
            "method":[
                "Heat oven to 190C/170C fan/gas 5.",
                "Tip 500ml double cream, 500ml milk and 3 garlic cloves into a large saucepan and bring to a simmer.",
                "Slice 8 large potatoes very finely, about 3-4mm, add them to the cream and simmer for 3 mins until just cooked.",
                "Gently stir to separate the potato and stop it sinking and catching on the bottom of the pan.",
                "Remove the potatoes with a slotted spoon and place in a wide shallow ovenproof dish so that they are about 5cm in depth.",
                "Pour over the garlic infused cream (discarding the garlic) – just enough to seep through the layers and leave a little moisture on the surface.",
                "Scatter over 100g grated gruyère cheese, if using, then bake for 30 mins until the potatoes are soft and browned – increase the heat for 5 mins if not brown enough."
            ] 
        },
        {
            "id":5,
            "name":"Butterfly cakes",
            "prep":"15 mins",
            "cook":"15 mins",
            "serves": 10,
            "ratings": 49,
            "desc": "Treat family and friends to pretty butterfly cupcakes. Ours easy buns are topped with a light vanilla buttercream, jam and sprinkles, but you can decorate any way you like",
            "ingredients":[
                "110g butter , softened",
                "110g caster sugar",
                "2 eggs",
                "1 tsp vanilla extract",
                "110g self-raising flour",
                "½ tsp baking powder",
                "1 tbsp milk , plus 2 tbsp if needed, to loosen the buttercream",
                "strawberry jam (optional)",
                "sprinkles (optional)",
                "300g icing sugar",
                "150g butter , softened",
                "2 tsp vanilla paste"
            ],
            "nutrition":{
                "kcal":419,
                "fat":"23g",
                "saturates":"14g",
                "carbs":"50g",
                "sugars":"42g",
                "fibre":"0g",
                "protein":"3g",
                "salt":"0.7g"
            },
            "method":[
                "Heat the oven to 180C/160C fan/gas 4. Line a cupcake tin with 10 cases. To make the sponge, tip the butter, sugar, eggs, vanilla, flour, baking powder and milk into a large mixing bowl and beat with either a hand whisk or electric mixer until smooth, pale and combined. Divide the batter between the cases and bake for 15 mins until golden brown and a skewer inserted in the middle of a cake comes out clean. Leave on a wire rack to cool.",
                "While the cakes are cooling, make the buttercream by beating together the icing sugar, butter and vanilla until pale and fluffy. Mix in the extra milk if the icing feels too stiff.",
                "Once the cakes are cool, use a sharp knife to slice off the tops, then cut the tops in half. Pipe or spread the buttercream on top of the cakes, then gently push two semi-circular halves into the buttercream on each cake, doing this at an angle to look like butterfly wings. You can serve the cupcakes at this stage, or decorate them with a little blob of jam in the centre and a scattering of sprinkles, if you like."
            ] 
        },
        {
            "id":6,
            "name":"Haddock & leek au gratin with sweetcorn mash",
            "prep":"10 mins",
            "cook":"50 mins",
            "serves": 2,
            "ratings": 13,
            "desc": "Leek and spinach are layered up with white fish fillets and cheese sauce then topped with golden mash in this delicious, low-fat oven bake.",
            "ingredients":[
                "350g potatoes , quartered",
                "195g can sweetcorn in water",
                "240g bag ready-washed spinach",
                "2 leeks , thickly sliced",
                "300ml skimmed milk , plus 3 tbsp",
                "15g unsalted butter",
                "15g plain flour",
                "½ tsp English mustard",
                "75g mature reduced-fat cheese , grated",
                "2 x 125g fillets of skinless haddock"
            ],
            "nutrition":{
                "kcal":618,
                "fat":"13g",
                "saturates":"6g",
                "carbs":"70g",
                "sugars":"20g",
                "fibre":"11g",
                "protein":"50g",
                "salt":"2.1g"
            },
            "method":[
                "Heat oven to 200C/180 fan/gas 6. Boil the potatoes for 15-20 mins until tender, then drain. Reserve 3 tbsp corn and blitz the rest (with its juice) using a hand blender or a food processor until completely smooth, then mash into the potatoes. Cook the spinach following pack instructions – if you have a microwave, choose this method.",
                "Put the leeks in a pan with the 300ml milk and the butter. Cook gently, part-covered, for 8 mins until the leeks are tender. (Keep an eye on things as milk can easily boil over.) Mix the 3 tbsp milk with the flour and mustard, then stir into the leek mixture – keep stirring until thickened. Take off the heat and stir in three-quarters of the cheese.",
                "Squeeze as much liquid as you can from the spinach, then arrange on the base of 2 gratin dishes. Place a fish fillet on top of each, then spoon over the leek & cheese sauce. Top with the sweetcorn mash. Mix the remaining corn and cheese, and scatter on top. Place the dishes on a baking tray and cook for 25 mins until the fish flakes when tested and the top is golden."
            ] 
        },
        {
            "id":7,
            "name":"Creamy egg curry",
            "prep":"10 mins",
            "cook":"20 mins",
            "serves": 4,
            "ratings": 38,
            "desc": "It may seem like an unusual combination but this is delicious. Why not try it and see.",
            "ingredients":[
                "2 tbsp sunflower oil",
                "2 onions , thinly sliced",
                "2 heaped tbsp curry paste (we used Patak's Tikka Masala)",
                "400g can chopped tomato",
                "8 eggs",
                "140g frozen pea",
                "4 tbsp Greek yogurt",
                "rice and mango chutney to serve"
            ],
            "nutrition":{
                "kcal":336,
                "fat":"24g",
                "saturates":"5g",
                "carbs":"11g",
                "sugars":"7g",
                "fibre":"3g",
                "protein":"20g",
                "salt":"1.02g"
            },
            "method":[
                "Heat the oil in a pan, then fry the onions over a low heat for 10 mins until golden. Add the curry paste and sizzle for 2 mins, stirring. Add the tomatoes and 200ml water, season to taste, then bring to the boil. Simmer for 10 mins until you have a rich sauce.",
                "Meanwhile, boil the eggs for 8 mins, cool in cold water, then peel and halve. 3 Stir the peas and yogurt into the curry and simmer for another 2-3 mins. Put the eggs into the pan, spoon the curry sauce over and leave for another 2 mins to heat through. Serve with rice and mango chutney."
            ] 
        },
        {
            "id":8,
            "name":"Roast cauliflower with caper dressing",
            "prep":"20 mins",
            "cook":"40 mins",
            "serves": 6,
            "ratings": 6,
            "desc": "Cooking cauliflower this way gives it a richness that's balanced by the dressing. A great side dish for a roast dinner and it also works as a vegetarian main",
            "ingredients":[
                "1 medium cauliflower , leaves trimmed and reserved",
                "50g butter , softened",
                "1 tbsp olive oil",
                "4 tbsp capers",
                "2 tbsp chopped parsley",
                "1 lemon , zested and juiced"
            ],
            "nutrition":{
                "kcal":112,
                "fat":"9g",
                "saturates":"5g",
                "carbs":"4g",
                "sugars":"3g",
                "fibre":"2g",
                "protein":"2g",
                "salt":"0.7g"
            },
            "method":[
                "Heat oven to 190C/170C fan/gas 5. Scatter the cauliflower leaves into a small roasting tin, then sit the cauliflower in the middle. Rub over the butter, sprinkle with some salt and roast for 20 mins.",
                "Reduce the temperature to 160C/140C/gas 3 and cook the cauliflower for 20 mins more, basting with butter. Add the oil, capers, parsley and lemon zest and juice to the hot butter and spoon over the cauliflower a few times before serving – it will soak up the dressing flavour. When you’re ready to serve, cut into wedges and serve with the crisp leaves."
            ] 
        }
    ]
}